import React from 'react'
import { useRef,useEffect } from 'react';
import Image from 'next/image';
import Link from 'next/link';
import gsap from 'gsap';
function Index() {

          
    const pageRef = useRef(null);

  
    useEffect(() => {
      gsap.from(pageRef.current, {
        opacity: 0,
        y: 50,
        duration: 2,
        ease: "power3.out",
      });
    }, []);
  return (
    <div  ref={pageRef} className='  relative  min-h-screen'>
               <Image className=' fixed top-0 left-0 w-full h-full' src={'/assets/template4/1.webp'} width={10000} height={100000} alt='Landingng'/>
               <div className='  fixed top-0 left-0 w-full h-full min-h-screen bg-[#FE5CCD]/20'></div>
  
   <div className=' lg:p-6  pt-20 p-0 lg:py-15 py-6 pb-0 lg:backdrop-blur-[2px] backdrop-blur-[2px] 
   flex  lg:flex-row flex-col items-center 

    justify-start lg:justify-center  lg:items-start gap-6 w-full min-h-screen'>
   
   <div className='   relative z-10  pr-0 p-10  lg:pr-14  lg:bg-white/50
bg-white/80
    border-white/30 flex flex-col px-0 lg:px-4  h-fit lg:h-[771px] 
       lg:bg-none rounded-[24px] border-[1px]   
 items-center justify-start lg:items-start gap-5  w-[361px] lg:w-[590px]'>

<Image className=' lg:hidden block  w-[125px] absolute -top-16 h-[125px] aspect-square' src={'/assets/template4/3.png'} width={1000} height={1000} alt='logo_Img'/>
<div className='relative px-5 lg:px-0 z-10  lg:w-fit w-full    flex-row  flex justify-start items-center gap-6'>
        
        <Image className=' lg:block hidden lg:w-[177px] lg:h-[177px] w-[88px] h-[88px] aspect-square' src={'/assets/template4/2.png'} width={1000} height={1000} alt='logo_Img'/>
       
         <div className=' flex lg:w-fit  w-full flex-col gap-0 items-start justify-center'>
        
         <span className=' text-[18px] lg:w-fit text-center w-full  mt-10 lg:mt-0 lg:text-[20px] lg:text-[#464646] text-[#781BE1]  cursor-pointer font-black'>نام فروشگاه شما</span>
         <span className=' text-[16px]  lg:block hidden  text-[#464646] font-semibold'>cosmetics & skin/haircare</span>
         <div className='w-[244px] mt-5 text-white lg:block hidden font-extrabold text-[16px] text-center py-2 rounded-[12px] cursor-pointer transition-all duration-150 ease-in-out hover:scale-95  bg-btn4'>مشاهده منوی رستوران</div>
       
         </div>
        
        
        </div>


        <p className='relative z-10 px-5 lg:px-0 text-[#2C2C2C]   h-[#FFFFFF]  lg:text-[20px] lg:w-fit w-[361px] text-[13px] font-medium'>گرچه به دلیل شهرت کباب شاندیز مشهد شاید بیش از یکصد رستوران نام شاندیز را با خود همراه دارند، اما این رستوران محبوب ترین و تا همین چند وقت پیش معروف ترین شاندیز تهران بوده است. علیرغم وسعت بزرگ رستوران اما به دلیل کیفیت مشتری پسند آن ظهرها علی الخصوص روزهای آخر هفته باید حداقل نیم ساعت زمان را برای صف انتظار شاندیز در نظر داشته باشید.</p>
        <div className='w-[335px]  lg:hidden block font-extrabold text-[14px] text-center py-3.5 cursor-pointer transition-all duration-150 ease-in-out hover:scale-95 rounded-[12px]  bg-btn4'>مشاهده منوی رستوران</div>
    

</div>

<div className=' flex flex-col relative z-10   lg:w-fit w-full  justify-start items-center gap-5'>



<div className='   lg:w-[687px] w-[361px]'>

    <div className=' relative z-10 flex flex-col   gap-10 bg-white  justify-start
     items-center p-2 py-4 lg:p-5 lg:pr-8  rounded-[18px] w-[361px] lg:w-[687px] h-fit lg:h-[224px]'>
        <ul  className=' hidden lg:flex  justify-start w-full   items-center gap-2'>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]  py-2 text-center rounded-full    text-[#535353] font-extrabold text-[16px]'>شنبه</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6] py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>یکشنبه</li>
            <li className='w-[80px]  bg-[#781BE1]  py-2 text-center rounded-full  text-white font-extrabold text-[16px]'>دوشنبه</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6] py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>سه‌شنبه</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]  py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>چهارشنبه</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]  py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>پنجشنبه</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]  py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>جمعه</li>
        </ul>



        <ul  className='  flex lg:hidden  justify-start w-full   items-center gap-2'>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]    py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>ش</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]  py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>ی</li>
            <li className='w-[80px]  bg-[#781BE1]  py-2 text-center rounded-full   text-white font-extrabold text-[16px]'>د</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]   py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>س</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]   py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>چ</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]   py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>پ</li>
            <li className='w-[80px] bg-[#FFF3F5] border-[1px] border-[#F6B9C6]   py-2 text-center rounded-full text-[#535353] font-extrabold text-[16px]'>ج</li>
        </ul>

        <div className=' lg:flex hidden   justify-start w-full    items-center gap-5'>
        <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" fill="#781BE1"/>
<path d="M12 10L16 14L12 18" stroke="white"/>
</svg>



<div className='w-[150px] flex items-center  justify-center gap-2   h-[76px] bg-[#F9C5DA] rounded-[40px]'>
            <span className=' text-[#3B3B3B] text-[28px] lg:text-[46.94px] font-extrabold'>
                14
            </span>

            
            <div className=' flex flex-col justify-center items-center lg:items-start gap-0.5'>
                <span className='text-[#3B3B3B] text-[13px] lg:text-[18.78px] font-medium'>اسفند</span>
                <span className=' text-[#3B3B3B] text-[13px] lg:text-[18.78px] font-medium'>دوشنبه</span>
            </div>
            </div>

         

          <p className='w-[473px] text-[13px] lg:text-[16px] font-medium h-[85px] max-h-[85px] overflow-y-auto text-black rounded-[28px] p-2 bg-white'>
          متنی ساختگی و بدون معنی است که برای امتحان فونت و یا پر کردن فضا در یک طراحی گرافیکی و یا صنعت چاپ استفاده میشود. طراحان وب و گرافیک از این متن برای پرکردن صفحه و ارائه شکل کلی طرح استفاده می‌کنند.
          </p>

          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" transform="matrix(-1 0 0 1 28 0)" fill="#781BE1"/>
<path d="M16 10L12 14L16 18" stroke="white"/>
</svg>


        </div>





        <div className=' w-full mt-2 lg:hidden flex flex-col justify-start gap-1 items-center'>

            <div className=' flex justify-center items-center gap-2.5'>

            <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" fill="#781BE1"/>
<path d="M12 10L16 14L12 18" stroke="white"/>
</svg>



            <div className='w-[148px] flex items-center  justify-center gap-2   h-[55px] bg-[#F9C5DA] rounded-[40px]'>
            <span className=' text-[#3B3B3B] text-[28px] lg:text-[46.94px] font-extrabold'>
                14
            </span>

            
            <div className=' flex flex-col justify-center items-center lg:items-start gap-0.5'>
                <span className='text-[#3B3B3B] text-[13px] lg:text-[18.78px] font-medium'>اسفند</span>
                <span className=' text-[#3B3B3B] text-[13px] lg:text-[18.78px] font-medium'>دوشنبه</span>
            </div>
            </div>

            <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" transform="matrix(-1 0 0 1 28 0)" fill="#781BE1"/>
<path d="M16 10L12 14L16 18" stroke="white"/>
</svg>



            </div>

            <p className=' w-full text-[13px] lg:text-[16px] font-medium h-fit  text-black  p-2 bg-white'>
          متنی ساختگی و بدون معنی است که برای امتحان فونت و یا پر کردن فضا در یک طراحی گرافیکی و یا صنعت چاپ استفاده میشود. طراحان وب و گرافیک از این متن برای پرکردن صفحه و ارائه شکل کلی طرح استفاده می‌کنند.
          </p>

        </div>


    </div>


</div>





<div className=' lg:w-[687px] z-0 bg-white/75 relative w-[361px] overflow-hidden lg:flex-row  flex-col flex justify-between p-6 items-center lg:items-start   rounded-[18px] h-[279px]'>

<div className='w-[140px] absolute rounded-full lg:hidden flex    z-0 -left-6 -top-6 bg-[#FFD4E0] h-[140px]'></div>
<div className='w-[140px] absolute rounded-full  lg:hidden flex  z-0 -right-12 -bottom-12 bg-[#FFD4E0] h-[140px]'></div>
<div className='w-[175px] absolute rounded-full  hidden lg:flex  z-0 -left-2 -bottom-12 bg-[#FFD4E080] h-[175px]'></div>
<div className='w-[140px] absolute rounded-full  hidden lg:flex  z-0 -right-16 -top-16 bg-[#FFD4E0] h-[140px]'></div>

  <ul className=' lg:flex z-10  relative hidden flex-col  justify-start  items-start lg:gap-2 gap-1'>
    <li className=' text-[#3E3E3E]   w-full text-center  lg:w-fit font-extrabold text-[16px] lg:text-[20px]'>راه‌های ارتباطی</li>
    <li className=' mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect x="0.0878906" y="0.243652" width="34.2821" height="34.2821" rx="17.141" fill="#EA9EBC"/>
<path d="M17.2282 25.4194C21.6658 25.4194 25.2631 21.8221 25.2631 17.3846C25.2631 16.2763 25.0387 15.2204 24.6329 14.2599M17.2282 25.4194C12.7907 25.4194 9.19336 21.8221 9.19336 17.3846C9.19336 16.2763 9.41775 15.2204 9.82357 14.2599M17.2282 25.4194C19.3816 23.9781 20.7993 20.1704 20.7993 17.3846C20.7993 14.5988 19.3816 10.7911 17.2282 9.34973M17.2282 25.4194C15.0749 23.9781 13.6572 20.1704 13.6572 17.3846C13.6572 14.5988 15.0749 10.7911 17.2282 9.34973M24.6329 14.2599C23.4138 11.3746 20.5575 9.34973 17.2282 9.34973M24.6329 14.2599C23.4138 17.1452 20.5575 19.1701 17.2282 19.1701C13.899 19.1701 11.0427 17.1452 9.82357 14.2599M9.82357 14.2599C11.0427 11.3746 13.899 9.34973 17.2282 9.34973" stroke="white" stroke-width="1.33914" stroke-linejoin="round"/>
</svg>



</div>
<div className='  text-[#3E3E3E] text-[14px] lg:text-[17px]  font-bold flex justify-start items-center'><span>وبسایت اصلی:</span><span className=' w-fit text-[14px] lg:text-[17px] font-medium'>www.example.com</span></div>
    </li>

    <li className='mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="35" height="36" viewBox="0 0 35 36" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect x="0.0878906" y="0.871826" width="34.2821" height="34.2821" rx="17.141" fill="#EA9EBC"/>
<path d="M9.20953 13.4652L9.87909 13.4614C9.87897 13.4398 9.8778 13.4181 9.87558 13.3966L9.20953 13.4652ZM21.7804 26.0311L21.849 25.365C21.8274 25.3629 21.8058 25.3617 21.7841 25.3616L21.7804 26.0311ZM12.8137 16.2273L12.708 15.5661C12.4938 15.6004 12.3095 15.7362 12.2134 15.9307C12.1173 16.1252 12.1214 16.3541 12.2243 16.5451L12.8137 16.2273ZM19.0172 22.4284L18.6997 23.0179C18.8905 23.1207 19.1194 23.1248 19.3139 23.0287C19.5082 22.9326 19.6441 22.7483 19.6784 22.5342L19.0172 22.4284ZM10.5815 11.4082C11.5403 10.4498 13.095 10.4498 14.0538 11.4082L15.0005 10.4611C13.5188 8.97993 11.1165 8.97993 9.63482 10.4611L10.5815 11.4082ZM14.0538 11.4082C15.0124 12.3665 15.0124 13.92 14.0538 14.8783L15.0005 15.8254C16.4824 14.3441 16.4824 11.9424 15.0005 10.4611L14.0538 11.4082ZM20.3663 21.1892C21.3252 20.2308 22.8797 20.2308 23.8386 21.1892L24.7853 20.242C23.3035 18.7609 20.9014 18.7609 19.4197 20.242L20.3663 21.1892ZM23.8386 21.1892C24.7972 22.1474 24.7972 23.701 23.8386 24.6593L24.7853 25.6064C26.2671 24.1251 26.2671 21.7234 24.7853 20.242L23.8386 21.1892ZM13.7379 21.5041C11.2151 18.9823 9.89323 15.9518 9.87909 13.4614L8.53997 13.469C8.55655 16.3891 10.0794 19.7405 12.7912 22.4513L13.7379 21.5041ZM9.87558 13.3966C9.8023 12.6856 10.0379 11.9516 10.5815 11.4082L9.63482 10.4611C8.7941 11.3015 8.43064 12.4389 8.54349 13.5339L9.87558 13.3966ZM23.8386 24.6593C23.295 25.2027 22.5605 25.4383 21.849 25.365L21.7117 26.6971C22.8068 26.81 23.9446 26.4467 24.7853 25.6064L23.8386 24.6593ZM21.7841 25.3616C19.2925 25.3475 16.2607 24.0259 13.7379 21.5041L12.7912 22.4513C15.503 25.1619 18.8555 26.6841 21.7766 26.7007L21.7841 25.3616ZM14.0538 14.8783C13.6733 15.2586 13.2007 15.4874 12.708 15.5661L12.9194 16.8885C13.6812 16.7667 14.4139 16.4118 15.0005 15.8254L14.0538 14.8783ZM15.9474 19.2955C14.8869 18.2354 14.0343 17.0803 13.403 15.9095L12.2243 16.5451C12.9192 17.834 13.8509 19.0933 15.0007 20.2427L15.9474 19.2955ZM19.6784 22.5342C19.7571 22.0418 19.9859 21.5695 20.3663 21.1892L19.4197 20.242C18.833 20.8285 18.4779 21.5609 18.356 22.3226L19.6784 22.5342ZM19.3348 21.8389C18.1635 21.2079 17.008 20.3557 15.9474 19.2955L15.0007 20.2427C16.1505 21.3919 17.4103 22.3232 18.6997 23.0179L19.3348 21.8389Z" fill="white"/>
</svg>



</div>
<div className=' text-[#3E3E3E] text-[14px] lg:text-[17px] font-bold flex justify-start items-center'><span>شماره تماس:</span><span className=' w-fit text-[14px] lg:text-[17px] font-medium'>021-123456</span></div>
    </li>

    <li className=' mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="36" height="35" viewBox="0 0 36 35" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect x="0.792969" y="0.5" width="34.2821" height="34.2821" rx="17.141" fill="#EA9EBC"/>
<path d="M9.89844 17.6413C9.89844 15.5614 9.89844 14.5215 10.2382 13.7011C10.6913 12.6074 11.5603 11.7384 12.654 11.2853C13.4743 10.9456 14.5143 10.9456 16.5942 10.9456H19.2724C21.3523 10.9456 22.3923 10.9456 23.2126 11.2853C24.3064 11.7384 25.1753 12.6074 25.6284 13.7011C25.9681 14.5215 25.9681 15.5614 25.9681 17.6413C25.9681 19.7211 25.9681 20.7611 25.6284 21.5814C25.1753 22.6752 24.3064 23.5441 23.2126 23.9972C22.3923 24.337 21.3523 24.337 19.2724 24.337H16.5942C14.5143 24.337 13.4743 24.337 12.654 23.9972C11.5603 23.5441 10.6913 22.6752 10.2382 21.5814C9.89844 20.7611 9.89844 19.7211 9.89844 17.6413Z" stroke="white" stroke-width="1.33914" stroke-linejoin="round"/>
<path d="M9.89844 14.0703L13.0007 16.483C15.0983 18.1144 16.1471 18.9302 17.3452 19.0895C17.7358 19.1414 18.1315 19.1414 18.5221 19.0894C19.7202 18.9301 20.7689 18.1143 22.8665 16.4828L25.9681 14.0703" stroke="white" stroke-width="1.33914" stroke-linejoin="round"/>
</svg>






</div>
<div className=' text-[#3E3E3E] text-[14px] lg:text-[17px] font-bold flex justify-start items-center'><span>پست الکترونیک:</span><span className=' w-fit text-[14px] lg:text-[17px] font-medium'>Example@email.com</span></div>
    </li>

    <li className='mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="36" height="35" viewBox="0 0 36 35" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect x="0.792969" y="0.5" width="34.2821" height="34.2821" rx="17.141" fill="#EA9EBC"/>
<path d="M9.89844 17.6413C9.89844 15.5614 9.89844 14.5215 10.2382 13.7011C10.6913 12.6074 11.5603 11.7384 12.654 11.2853C13.4743 10.9456 14.5143 10.9456 16.5942 10.9456H19.2724C21.3523 10.9456 22.3923 10.9456 23.2126 11.2853C24.3064 11.7384 25.1753 12.6074 25.6284 13.7011C25.9681 14.5215 25.9681 15.5614 25.9681 17.6413C25.9681 19.7211 25.9681 20.7611 25.6284 21.5814C25.1753 22.6752 24.3064 23.5441 23.2126 23.9972C22.3923 24.337 21.3523 24.337 19.2724 24.337H16.5942C14.5143 24.337 13.4743 24.337 12.654 23.9972C11.5603 23.5441 10.6913 22.6752 10.2382 21.5814C9.89844 20.7611 9.89844 19.7211 9.89844 17.6413Z" stroke="white" stroke-width="1.33914" stroke-linejoin="round"/>
<path d="M9.89844 14.0703L13.0007 16.483C15.0983 18.1144 16.1471 18.9302 17.3452 19.0895C17.7358 19.1414 18.1315 19.1414 18.5221 19.0894C19.7202 18.9301 20.7689 18.1143 22.8665 16.4828L25.9681 14.0703" stroke="white" stroke-width="1.33914" stroke-linejoin="round"/>
</svg>




</div>
<div className='text-[#3E3E3E] text-[14px] lg:text-[17px] font-bold flex justify-start items-center'><span>آدرس:</span><span className='  w-fit text-[14px] lg:text-[17px] font-medium'>تهران، خیابان جردن، بلوار صبا
</span></div>
    </li>


  </ul>



  <ul className=' lg:hidden flex flex-col z-10  relative justify-start  items-start lg:gap-2 gap-1'>
    <li className=' text-[#3E3E3E]   w-full text-center  lg:w-fit font-extrabold text-[16px] lg:text-[20px]'>راه‌های ارتباطی</li>
    <li className=' mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" fill="#EA9EBC"/>
<path d="M14 20.5625C17.6244 20.5625 20.5625 17.6244 20.5625 14C20.5625 13.0948 20.3793 12.2324 20.0478 11.4479M14 20.5625C10.3756 20.5625 7.4375 17.6244 7.4375 14C7.4375 13.0948 7.62077 12.2324 7.95223 11.4479M14 20.5625C15.7588 19.3853 16.9167 16.2753 16.9167 14C16.9167 11.7247 15.7588 8.61475 14 7.4375M14 20.5625C12.2413 19.3853 11.0833 16.2753 11.0833 14C11.0833 11.7247 12.2413 8.61475 14 7.4375M20.0478 11.4479C19.0521 9.09129 16.7192 7.4375 14 7.4375M20.0478 11.4479C19.0521 13.8045 16.7192 15.4583 14 15.4583C11.2808 15.4583 8.94792 13.8045 7.95223 11.4479M7.95223 11.4479C8.94792 9.09129 11.2808 7.4375 14 7.4375" stroke="white" stroke-width="1.09375" stroke-linejoin="round"/>
</svg>


</div>
<div className=' text-[#3E3E3E] text-[14px] lg:text-[17px]  font-bold flex justify-start items-center'><span>وبسایت اصلی:</span><span className=' w-fit text-[14px] lg:text-[17px] font-medium'>www.example.com</span></div>
    </li>

    <li className='mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" fill="#EA9EBC"/>
<path d="M14 20.5625C17.6244 20.5625 20.5625 17.6244 20.5625 14C20.5625 13.0948 20.3793 12.2324 20.0478 11.4479M14 20.5625C10.3756 20.5625 7.4375 17.6244 7.4375 14C7.4375 13.0948 7.62077 12.2324 7.95223 11.4479M14 20.5625C15.7588 19.3853 16.9167 16.2753 16.9167 14C16.9167 11.7247 15.7588 8.61475 14 7.4375M14 20.5625C12.2413 19.3853 11.0833 16.2753 11.0833 14C11.0833 11.7247 12.2413 8.61475 14 7.4375M20.0478 11.4479C19.0521 9.09129 16.7192 7.4375 14 7.4375M20.0478 11.4479C19.0521 13.8045 16.7192 15.4583 14 15.4583C11.2808 15.4583 8.94792 13.8045 7.95223 11.4479M7.95223 11.4479C8.94792 9.09129 11.2808 7.4375 14 7.4375" stroke="white" stroke-width="1.09375" stroke-linejoin="round"/>
</svg>



</div>
<div className=' text-[#3E3E3E] text-[14px] lg:text-[17px] font-bold flex justify-start items-center'><span>شماره تماس:</span><span className=' w-fit text-[14px] lg:text-[17px] font-medium'>021-123456</span></div>
    </li>

    <li className=' mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" fill="#EA9EBC"/>
<path d="M7.451 10.2857L7.99786 10.2826C7.99776 10.2649 7.99681 10.2473 7.99499 10.2297L7.451 10.2857ZM17.7183 20.549L17.7743 20.005C17.7567 20.0032 17.7391 20.0022 17.7214 20.0021L17.7183 20.549ZM10.3947 12.5417L10.3084 12.0017C10.1334 12.0296 9.98287 12.1406 9.90439 12.2995C9.82591 12.4583 9.82925 12.6453 9.91333 12.8012L10.3947 12.5417ZM15.4615 17.6065L15.2021 18.0879C15.358 18.1719 15.5449 18.1752 15.7038 18.0968C15.8625 18.0183 15.9735 17.8677 16.0015 17.6929L15.4615 17.6065ZM8.57159 8.60565C9.3547 7.82286 10.6244 7.82286 11.4075 8.60565L12.1808 7.8321C10.9706 6.62237 9.00855 6.62237 7.79835 7.8321L8.57159 8.60565ZM11.4075 8.60565C12.1905 9.38833 12.1905 10.6572 11.4075 11.4399L12.1808 12.2134C13.3911 11.0036 13.3911 9.04195 12.1808 7.8321L11.4075 8.60565ZM16.5634 16.5943C17.3465 15.8115 18.6162 15.8115 19.3993 16.5943L20.1726 15.8207C18.9623 14.611 17.0004 14.611 15.7902 15.8207L16.5634 16.5943ZM19.3993 16.5943C20.1823 17.377 20.1823 18.6459 19.3993 19.4286L20.1726 20.2021C21.3829 18.9922 21.3829 17.0306 20.1726 15.8207L19.3993 16.5943ZM11.1496 16.8516C9.08908 14.7919 8.00941 12.3167 7.99786 10.2826L6.90413 10.2888C6.91767 12.6739 8.16148 15.4111 10.3763 17.6251L11.1496 16.8516ZM7.99499 10.2297C7.93514 9.64896 8.1276 9.04948 8.57159 8.60565L7.79835 7.8321C7.11169 8.51849 6.81483 9.44754 6.907 10.3418L7.99499 10.2297ZM19.3993 19.4286C18.9553 19.8724 18.3554 20.0648 17.7743 20.005L17.6622 21.093C18.5566 21.1851 19.4859 20.8884 20.1726 20.2021L19.3993 19.4286ZM17.7214 20.0021C15.6863 19.9906 13.2101 18.9112 11.1496 16.8516L10.3763 17.6251C12.5912 19.8391 15.3294 21.0823 17.7152 21.0959L17.7214 20.0021ZM11.4075 11.4399C11.0968 11.7505 10.7108 11.9373 10.3084 12.0017L10.481 13.0817C11.1033 12.9822 11.7017 12.6924 12.1808 12.2134L11.4075 11.4399ZM12.9542 15.0477C12.088 14.1818 11.3916 13.2384 10.8761 12.2822L9.91333 12.8012C10.4809 13.8539 11.2419 14.8825 12.1809 15.8212L12.9542 15.0477ZM16.0015 17.6929C16.0658 17.2907 16.2526 16.9049 16.5634 16.5943L15.7902 15.8207C15.311 16.2997 15.021 16.8979 14.9214 17.5201L16.0015 17.6929ZM15.7208 17.125C14.7642 16.6096 13.8204 15.9136 12.9542 15.0477L12.1809 15.8212C13.12 16.7599 14.149 17.5206 15.2021 18.0879L15.7208 17.125Z" fill="white"/>
</svg>


</div>
<div className=' text-[#3E3E3E] text-[14px] lg:text-[17px] font-bold flex justify-start items-center'><span>پست الکترونیک:</span><span className=' w-fit text-[14px] lg:text-[17px] font-medium'>Example@email.com</span></div>
    </li>

    <li className='mr-0 lg:mr-3 flex gap-1 justify-start items-center'>
      <div><svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="28" height="28" rx="14" fill="#EA9EBC"/>
<path d="M14 8.89583V7.4375M14 8.89583C16.819 8.89583 19.1042 11.181 19.1042 14M14 8.89583C11.181 8.89583 8.89583 11.181 8.89583 14M19.1042 14C19.1042 16.819 16.819 19.1042 14 19.1042M19.1042 14H20.5625M8.89583 14H7.4375M8.89583 14C8.89583 16.819 11.181 19.1042 14 19.1042M14 19.1042V20.5625M14 15.8229C12.9932 15.8229 12.1771 15.0068 12.1771 14C12.1771 12.9932 12.9932 12.1771 14 12.1771C15.0068 12.1771 15.8229 12.9932 15.8229 14C15.8229 15.0068 15.0068 15.8229 14 15.8229Z" stroke="white" stroke-width="1.09375" stroke-linecap="round" stroke-linejoin="round"/>
</svg>


</div>
<div className=' text-[#3E3E3E] text-[14px] lg:text-[17px] font-bold flex justify-start items-center'><span>آدرس:</span><span className='  w-fit text-[14px] lg:text-[17px] font-medium'>تهران، خیابان جردن، بلوار صبا
</span></div>
    </li>


  </ul>







  <div className=' flex  relative z-30 flex-col items-center lg:items-start gap-3'>
    <span className=' text-[#3E3E3E] w-full text-center  lg:w-fit  text-[16px] lg:text-[20px] font-extrabold'>شبکه‌های اجتماعی</span>

    <div className='  hidden lg:flex  justify-start items-center gap-1.5'>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#781BE1"/>
<path d="M19.9995 9.09094C17.0369 9.09094 16.6651 9.1039 15.5015 9.15685C14.3401 9.21003 13.5474 9.3939 12.8538 9.66367C12.1363 9.94231 11.5277 10.315 10.9214 10.9216C10.3146 11.528 9.94186 12.1366 9.66233 12.8539C9.39188 13.5478 9.20779 14.3407 9.15552 15.5016C9.10348 16.6653 9.08984 17.0373 9.08984 20C9.08984 22.9628 9.10303 23.3334 9.15575 24.4971C9.20916 25.6584 9.39302 26.4512 9.66255 27.1448C9.94141 27.8623 10.3141 28.4709 10.9207 29.0773C11.5268 29.6841 12.1354 30.0578 12.8525 30.3364C13.5465 30.6062 14.3395 30.79 15.5006 30.8432C16.6642 30.8962 17.0357 30.9091 19.9981 30.9091C22.961 30.9091 23.3317 30.8962 24.4953 30.8432C25.6566 30.79 26.4502 30.6062 27.1443 30.3364C27.8615 30.0578 28.4693 29.6841 29.0754 29.0773C29.6822 28.4709 30.0549 27.8623 30.3344 27.145C30.6026 26.4512 30.7867 25.6582 30.8412 24.4973C30.8935 23.3337 30.9071 22.9628 30.9071 20C30.9071 17.0373 30.8935 16.6655 30.8412 15.5019C30.7867 14.3405 30.6026 13.5478 30.3344 12.8541C30.0549 12.1366 29.6822 11.528 29.0754 10.9216C28.4686 10.3148 27.8618 9.94208 27.1436 9.66367C26.4482 9.3939 25.655 9.21003 24.4937 9.15685C23.3301 9.1039 22.9597 9.09094 19.9961 9.09094H19.9995ZM19.0209 11.0569C19.3114 11.0564 19.6354 11.0569 19.9995 11.0569C22.9122 11.0569 23.2574 11.0673 24.4076 11.1196C25.4712 11.1682 26.0484 11.3459 26.433 11.4953C26.942 11.693 27.305 11.9294 27.6866 12.3112C28.0684 12.693 28.3047 13.0566 28.5029 13.5657C28.6522 13.9498 28.8302 14.5271 28.8786 15.5907C28.9308 16.7407 28.9422 17.0862 28.9422 19.9975C28.9422 22.9089 28.9308 23.2544 28.8786 24.4044C28.8299 25.468 28.6522 26.0453 28.5029 26.4294C28.3052 26.9384 28.0684 27.3009 27.6866 27.6825C27.3047 28.0644 26.9423 28.3007 26.433 28.4984C26.0489 28.6484 25.4712 28.8257 24.4076 28.8744C23.2576 28.9266 22.9122 28.938 19.9995 28.938C17.0866 28.938 16.7414 28.9266 15.5915 28.8744C14.5279 28.8253 13.9506 28.6475 13.5658 28.4982C13.0568 28.3005 12.6931 28.0641 12.3113 27.6823C11.9295 27.3005 11.6932 26.9378 11.495 26.4284C11.3457 26.0444 11.1677 25.4671 11.1193 24.4034C11.0671 23.2534 11.0566 22.908 11.0566 19.9948C11.0566 17.0816 11.0671 16.738 11.1193 15.588C11.168 14.5244 11.3457 13.9471 11.495 13.5625C11.6927 13.0534 11.9295 12.6898 12.3113 12.308C12.6931 11.9262 13.0568 11.6898 13.5658 11.4916C13.9504 11.3416 14.5279 11.1644 15.5915 11.1155C16.5978 11.07 16.9878 11.0564 19.0209 11.0541V11.0569ZM25.8225 12.8682C25.0998 12.8682 24.5135 13.4539 24.5135 14.1769C24.5135 14.8996 25.0998 15.4859 25.8225 15.4859C26.5452 15.4859 27.1316 14.8996 27.1316 14.1769C27.1316 13.4541 26.5452 12.8682 25.8225 12.8682ZM19.9995 14.3978C16.9057 14.3978 14.3974 16.9062 14.3974 20C14.3974 23.0939 16.9057 25.6012 19.9995 25.6012C23.0933 25.6012 25.6007 23.0939 25.6007 20C25.6007 16.9062 23.0933 14.3978 19.9995 14.3978ZM19.9995 16.3637C22.0076 16.3637 23.6358 17.9916 23.6358 20C23.6358 22.0082 22.0076 23.6364 19.9995 23.6364C17.9912 23.6364 16.3633 22.0082 16.3633 20C16.3633 17.9916 17.9912 16.3637 19.9995 16.3637Z" fill="#FBFCFC"/>
</svg>



</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95'  href={'/'}><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#781BE1"/>
<path d="M27.8512 12.0163L9.78976 18.9826C8.55704 19.4772 8.56435 20.1647 9.56507 20.4713L14.0696 21.8773L15.7932 27.1616C16.0027 27.7399 15.8994 27.9693 16.5068 27.9693C16.9755 27.9693 17.1834 27.7556 17.4444 27.5006C17.6104 27.3382 18.5961 26.3799 19.6966 25.3099L24.3822 28.7718C25.2444 29.2475 25.867 29.0011 26.0817 27.9711L29.1574 13.477C29.4723 12.2145 28.6761 11.6419 27.8512 12.0163ZM14.7766 21.5543L24.9299 15.1485C25.4368 14.8411 25.9015 15.0064 25.5199 15.3451L16.826 23.1892L16.4875 26.7997L14.7766 21.5543Z" fill="#FBFCFC"/>
</svg>



</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#781BE1"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M21.2935 8.69805C24.0795 8.83497 26.6756 9.98384 28.6584 11.968C30.7734 14.0843 31.9375 16.8975 31.9364 19.8892C31.9339 26.0628 26.908 31.0859 20.7341 31.0859C18.4124 31.0859 16.5674 30.3725 15.3761 29.7231L9.4375 31.2801L11.0268 25.4779C10.0465 23.7799 9.53062 21.8538 9.53143 19.8803C9.53391 13.7068 14.5593 8.6842 20.7339 8.6842L21.2935 8.69805ZM15.6512 27.696L15.9912 27.8977C17.4208 28.7456 19.0595 29.1943 20.7303 29.1949H20.734C25.866 29.1949 30.0429 25.02 30.0449 19.8885C30.0459 17.4019 29.0783 15.0637 27.3204 13.3046C25.5624 11.5455 23.2247 10.5761 20.7377 10.5753C15.6018 10.5753 11.4249 14.7498 11.4228 19.8809C11.4221 21.6394 11.9144 23.352 12.8464 24.8336L13.0678 25.1858L12.1272 28.62L15.6512 27.696ZM26.3777 22.5517C26.3078 22.4349 26.1212 22.365 25.8413 22.2249C25.5614 22.0849 24.1852 21.4081 23.9286 21.3146C23.6721 21.2214 23.4854 21.1747 23.2989 21.4547C23.1123 21.7348 22.5759 22.365 22.4125 22.5517C22.2493 22.7384 22.086 22.7618 21.8061 22.6217C21.5262 22.4818 20.6243 22.1863 19.5552 21.2331C18.723 20.4913 18.1613 19.5751 17.998 19.295C17.8347 19.015 17.9806 18.8635 18.1207 18.7241C18.2466 18.5987 18.4007 18.3973 18.5406 18.2339C18.6806 18.0706 18.7272 17.9538 18.8205 17.7672C18.9138 17.5804 18.8671 17.4171 18.7972 17.2771C18.7272 17.137 18.1674 15.7599 17.9342 15.1997C17.7069 14.6542 17.4762 14.728 17.3043 14.7194C17.1413 14.7113 16.9545 14.7096 16.7679 14.7096C16.5813 14.7096 16.278 14.7795 16.0215 15.0597C15.7649 15.3397 15.0418 16.0166 15.0418 17.3936C15.0418 18.7708 16.0448 20.101 16.1848 20.2878C16.3247 20.4746 18.1585 23.3003 20.9664 24.5122C21.6342 24.8005 22.1556 24.9726 22.5621 25.1015C23.2327 25.3145 23.8428 25.2845 24.3252 25.2124C24.8629 25.1321 25.9812 24.5356 26.2145 23.8822C26.4477 23.2285 26.4477 22.6684 26.3777 22.5517Z" fill="#FBFCFC"/>
</svg>


</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#781BE1"/>
<g clip-path="url(#clip0_307_2349)">
<path d="M29.9333 17.5392C29.2108 14.4155 27.0114 11.7061 24.0895 10.3567C22.9048 9.80953 21.667 9.44828 20.3548 9.40047C20.2858 9.40047 20.2114 9.39516 20.1423 9.39516C20.0361 9.39516 19.9298 9.38453 19.8236 9.38453C19.4411 9.36859 19.0586 9.36859 18.6761 9.41641C17.6508 9.50672 16.668 9.74047 15.7489 10.0964C15.7117 10.107 15.6692 10.123 15.632 10.1389C15.3345 10.2398 15.0583 10.3833 14.7767 10.5214C14.3252 10.7498 13.8789 10.9942 13.4698 11.297C13.353 11.382 13.3795 11.382 13.252 11.2917C12.742 10.9092 12.232 10.532 11.7061 10.1708C11.3555 9.93172 11.0155 9.69265 10.633 9.50672C10.1602 9.26765 9.60766 9.3739 9.25703 9.76172C9.04984 9.99547 8.96484 10.2717 8.96484 10.5798V20.2327C8.96484 20.2327 8.96484 20.2592 8.97016 20.2752C8.98078 21.0136 9.07109 21.7361 9.24109 22.4586C10.1495 26.2836 13.0714 29.2852 16.8698 30.2945C17.6083 30.4911 18.3573 30.6186 19.1223 30.6239C19.712 30.6292 20.307 30.6239 20.8967 30.5495C21.3589 30.4911 21.8158 30.4061 22.262 30.2892C22.6817 30.183 23.0855 30.0448 23.4839 29.8855C23.5211 29.8695 23.5636 29.8536 23.6008 29.8377C23.6114 29.8323 23.6167 29.8323 23.6273 29.827C27.4948 28.2386 30.2148 24.4402 30.2148 19.9989V19.7173C30.1936 18.9842 30.098 18.2564 29.9333 17.5392ZM25.678 18.692C24.8227 19.542 23.9727 20.392 23.1173 21.242C21.9273 22.432 20.732 23.6167 19.542 24.8067C19.117 25.2317 18.607 25.4389 18.0067 25.4123C17.4755 25.3911 17.0027 25.1945 16.6255 24.8173C15.5258 23.7177 14.4208 22.6127 13.3317 21.497C12.3117 20.4505 12.6411 18.7398 13.9586 18.1502C14.7395 17.8048 15.6533 17.9695 16.2536 18.5698C16.8273 19.1383 17.4011 19.712 17.9695 20.2858C17.9961 20.3123 18.028 20.3389 18.0492 20.3655C18.0811 20.4027 18.113 20.408 18.1448 20.3708C18.1767 20.3389 18.2086 20.3123 18.2405 20.2805C19.7439 18.7717 21.2527 17.263 22.7561 15.7542C23.1545 15.3558 23.6327 15.1433 24.1905 15.1273C25.3698 15.0902 26.3155 16.0198 26.3102 17.4277C26.3048 17.7836 26.087 18.283 25.678 18.692Z" fill="#FBFCFC"/>
</g>
<defs>
<clipPath id="clip0_307_2349">
<rect width="21.25" height="21.25" fill="white" transform="translate(8.96484 9.375)"/>
</clipPath>
</defs>
</svg>



</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="40" height="40" rx="20" fill="#781BE1"/>
<g clip-path="url(#clip0_307_2346)">
<path d="M14.5385 30.5755C13.7947 30.4639 13.0775 30.2142 12.4294 29.8423C10.9631 29.0187 9.86877 27.5469 9.51814 25.921C9.38002 25.2887 9.36408 24.4864 9.38002 19.5396C9.39596 14.2208 9.38002 14.4918 9.64564 13.6151C9.77314 13.1794 10.1291 12.4302 10.3894 12.053C11.3456 10.6609 12.7481 9.7682 14.4906 9.44408C14.836 9.38032 15.3406 9.37501 19.9731 9.37501C25.631 9.37501 25.445 9.36969 26.3694 9.6513C28.1863 10.2252 29.6313 11.596 30.2741 13.3548C30.5716 14.1836 30.5875 14.3165 30.6088 16.5003L30.6247 18.4769L30.2688 18.716C29.7641 19.0507 29.1 19.6565 28.1703 20.6182C27.1025 21.7287 26.0188 22.7595 25.4716 23.1899C24.2869 24.1197 23.2031 24.6511 22.0981 24.8424C21.5244 24.938 20.5735 24.9008 20.0156 24.7573C19.5163 24.6298 19.5481 24.6086 19.3569 25.1665C19.2028 25.6075 19.1072 26.0697 19.07 26.5373L19.0435 26.8986L18.9106 26.8721C17.811 26.6595 16.7219 25.735 16.3022 24.6564C16.1588 24.311 16.0791 23.9497 16.0685 23.5778L16.0525 23.2749L15.771 23.0252C15.1866 22.5044 14.8094 21.8615 14.6872 21.2027C14.496 20.1453 14.9953 18.9498 16.0791 17.8765C17.2213 16.7394 18.9106 15.8467 20.5628 15.5014C21.1578 15.3792 22.2097 15.3473 22.7356 15.4376C23.7663 15.613 24.6056 16.123 25.1316 16.8882C25.2963 17.1273 25.3069 17.1645 25.291 17.377C25.291 17.5364 25.2272 17.6905 25.1263 17.8127C24.7066 18.3866 23.4528 19.0082 22.1088 19.3005C19.7341 19.8159 18.22 19.1729 18.4591 17.7436C18.4803 17.6002 18.4963 17.4726 18.4856 17.4673C18.4591 17.4408 18.22 17.5577 17.965 17.733C17.5294 18.0306 17.1469 18.6044 17.0141 19.157C16.9822 19.2951 16.9663 19.5183 16.9822 19.7308C16.9981 20.0231 17.03 20.1347 17.1575 20.3844C17.2425 20.5491 17.4072 20.7829 17.5294 20.9051L17.7472 21.1283L17.6622 21.2345C17.4072 21.564 17.2 21.9253 17.0513 22.3132C16.8813 22.8339 16.8494 23.3865 16.9556 23.9178C17.0513 24.3269 17.3381 24.8849 17.625 25.2196C17.8428 25.4693 18.3475 25.8944 18.4272 25.8944C18.4485 25.8944 18.4644 25.8519 18.4644 25.7988C18.4644 25.5969 18.6291 24.938 18.7619 24.6245C19.1444 23.6893 19.9838 22.887 21.3119 22.1963C21.535 22.0794 22.1725 21.7818 22.7356 21.5268C23.9681 20.9689 24.6375 20.6288 25.0094 20.3738C26.0719 19.6352 26.7306 18.546 26.9485 17.1645C27.0281 16.6597 27.0281 15.7192 26.9485 15.2091C26.6138 13.0519 24.9616 11.5801 22.5869 11.341C19.9413 11.07 16.5678 13.0678 14.4906 16.1443C13.4813 17.6427 12.796 19.3005 12.5091 20.9636C12.3975 21.6065 12.355 22.8073 12.4241 23.3971C12.5994 24.9061 13.1678 26.1229 14.1453 27.0793C14.6341 27.5628 15.2078 27.956 15.84 28.2429C17.981 29.2419 20.3556 29.2631 22.4435 28.3067C23.3466 27.8922 24.2285 27.2493 25.1794 26.3142C26.1038 25.4056 26.7253 24.6511 28.4306 22.3663C29.371 21.107 30.12 20.2675 30.4866 20.0603L30.6247 19.9859L30.6088 22.7223C30.5928 25.3737 30.5875 25.4746 30.4972 25.8731C29.9553 28.2429 28.1969 29.9804 25.7956 30.5171L25.3706 30.6127L20.1431 30.6233C15.856 30.6287 14.8466 30.6233 14.5385 30.5755Z" fill="#FBFCFC"/>
</g>
<defs>
<clipPath id="clip0_307_2346">
<rect width="21.25" height="21.25" fill="white" transform="translate(9.375 9.375)"/>
</clipPath>
</defs>
</svg>

</Link>


    </div>







    <div className='  flex lg:hidden  justify-start items-center gap-5'>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="30" height="30" rx="15" fill="#781BE1"/>
<path d="M15.0006 6.81836C12.7786 6.81836 12.4998 6.82808 11.6271 6.86779C10.7561 6.90768 10.1616 7.04558 9.64134 7.2479C9.10323 7.45688 8.64677 7.73643 8.19201 8.19137C7.73691 8.64614 7.45737 9.10262 7.24772 9.64058C7.04489 10.161 6.90682 10.7557 6.86762 11.6264C6.82859 12.4991 6.81836 12.7781 6.81836 15.0002C6.81836 17.2222 6.82825 17.5002 6.86779 18.373C6.90785 19.244 7.04574 19.8385 7.24789 20.3588C7.45703 20.8969 7.73657 21.3534 8.1915 21.8081C8.64609 22.2632 9.10255 22.5435 9.64032 22.7524C10.1609 22.9548 10.7556 23.0927 11.6264 23.1326C12.4991 23.1723 12.7778 23.182 14.9996 23.182C17.2217 23.182 17.4997 23.1723 18.3724 23.1326C19.2434 23.0927 19.8386 22.9548 20.3592 22.7524C20.8971 22.5435 21.3529 22.2632 21.8075 21.8081C22.2626 21.3534 22.5421 20.8969 22.7518 20.3589C22.9529 19.8385 23.091 19.2438 23.1319 18.3731C23.1711 17.5004 23.1813 17.2222 23.1813 15.0002C23.1813 12.7781 23.1711 12.4993 23.1319 11.6265C23.091 10.7555 22.9529 10.161 22.7518 9.64075C22.5421 9.10262 22.2626 8.64614 21.8075 8.19137C21.3524 7.73626 20.8973 7.45671 20.3587 7.2479C19.8371 7.04558 19.2422 6.90768 18.3712 6.86779C17.4985 6.82808 17.2207 6.81836 14.9981 6.81836H15.0006ZM14.2667 8.29279C14.4845 8.29245 14.7276 8.29279 15.0006 8.29279C17.1851 8.29279 17.444 8.30063 18.3066 8.33984C19.1044 8.37631 19.5373 8.50961 19.8257 8.6216C20.2075 8.76989 20.4797 8.94717 20.7659 9.23353C21.0522 9.51989 21.2295 9.79262 21.3781 10.1744C21.4901 10.4625 21.6236 10.8955 21.6599 11.6932C21.6991 12.5557 21.7076 12.8148 21.7076 14.9983C21.7076 17.1818 21.6991 17.4409 21.6599 18.3034C21.6234 19.1011 21.4901 19.5341 21.3781 19.8222C21.2299 20.204 21.0522 20.4759 20.7659 20.7621C20.4795 21.0484 20.2077 21.2257 19.8257 21.374C19.5376 21.4865 19.1044 21.6194 18.3066 21.6559C17.4442 21.6951 17.1851 21.7036 15.0006 21.7036C12.816 21.7036 12.557 21.6951 11.6946 21.6559C10.8969 21.6191 10.4639 21.4858 10.1754 21.3738C9.79355 21.2255 9.52083 21.0482 9.23448 20.7619C8.94812 20.4755 8.77086 20.2035 8.62223 19.8215C8.51024 19.5334 8.37678 19.1005 8.34047 18.3027C8.30127 17.4402 8.29343 17.1811 8.29343 14.9963C8.29343 12.8114 8.30127 12.5536 8.34047 11.6911C8.37695 10.8934 8.51024 10.4605 8.62223 10.1721C8.77052 9.79023 8.94812 9.51751 9.23448 9.23114C9.52083 8.94478 9.79355 8.76751 10.1754 8.61887C10.4638 8.50637 10.8969 8.37342 11.6946 8.33677C12.4493 8.30268 12.7418 8.29245 14.2667 8.29075V8.29279ZM19.3679 9.65131C18.8258 9.65131 18.3861 10.0906 18.3861 10.6328C18.3861 11.1748 18.8258 11.6146 19.3679 11.6146C19.9099 11.6146 20.3497 11.1748 20.3497 10.6328C20.3497 10.0907 19.9099 9.65131 19.3679 9.65131ZM15.0006 10.7985C12.6803 10.7985 10.799 12.6798 10.799 15.0002C10.799 17.3206 12.6803 19.201 15.0006 19.201C17.3209 19.201 19.2015 17.3206 19.2015 15.0002C19.2015 12.6798 17.3209 10.7985 15.0006 10.7985ZM15.0006 12.2729C16.5067 12.2729 17.7278 13.4939 17.7278 15.0002C17.7278 16.5063 16.5067 17.7275 15.0006 17.7275C13.4944 17.7275 12.2734 16.5063 12.2734 15.0002C12.2734 13.4939 13.4944 12.2729 15.0006 12.2729Z" fill="#FBFCFC"/>
</svg>



</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95'  href={'/'}><svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="30" height="30" rx="15" fill="#781BE1"/>
<path d="M20.8889 9.0123L7.34281 14.237C6.41827 14.608 6.42375 15.1236 7.17429 15.3536L10.5527 16.4081L11.8454 20.3713C12.0025 20.805 11.9251 20.9771 12.3806 20.9771C12.7321 20.9771 12.888 20.8168 13.0838 20.6256C13.2083 20.5037 13.9475 19.785 14.7729 18.9825L18.2871 21.579C18.9338 21.9357 19.4007 21.7509 19.5617 20.9784L21.8685 10.1079C22.1047 9.161 21.5075 8.7315 20.8889 9.0123ZM11.0829 16.1658L18.6979 11.3615C19.0781 11.1309 19.4266 11.2549 19.1404 11.5089L12.62 17.392L12.3661 20.0998L11.0829 16.1658Z" fill="#FBFCFC"/>
</svg>



</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="30" height="30" rx="15" fill="#781BE1"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M15.9721 6.52357C18.0616 6.62626 20.0086 7.48791 21.4957 8.97602C23.082 10.5633 23.9551 12.6731 23.9543 14.9169C23.9524 19.5471 20.183 23.3144 15.5525 23.3144C13.8112 23.3144 12.4275 22.7794 11.534 22.2923L7.08008 23.4601L8.27205 19.1085C7.5368 17.8349 7.14992 16.3903 7.15053 14.9102C7.15239 10.2802 10.9214 6.51318 15.5524 6.51318L15.9721 6.52357ZM11.7403 20.7721L11.9954 20.9233C13.0676 21.5593 14.2966 21.8957 15.5496 21.8962H15.5525C19.4015 21.8962 22.5341 18.765 22.5357 14.9164C22.5364 13.0514 21.8107 11.2978 20.4923 9.9785C19.1738 8.65914 17.4205 7.93213 15.5553 7.93152C11.7033 7.93152 8.57062 11.0624 8.56909 14.9107C8.56856 16.2296 8.93774 17.514 9.63677 18.6253L9.80281 18.8894L9.09735 21.465L11.7403 20.7721ZM19.7852 16.9138C19.7328 16.8262 19.5928 16.7738 19.3829 16.6687C19.173 16.5637 18.1409 16.0561 17.9484 15.986C17.756 15.9161 17.616 15.8811 17.4761 16.0911C17.3362 16.3011 16.9338 16.7738 16.8113 16.9138C16.6889 17.0538 16.5664 17.0714 16.3566 16.9663C16.1466 16.8613 15.4702 16.6397 14.6683 15.9249C14.0442 15.3685 13.6229 14.6814 13.5004 14.4713C13.378 14.2613 13.4874 14.1477 13.5925 14.0431C13.6869 13.949 13.8024 13.798 13.9074 13.6755C14.0124 13.553 14.0473 13.4654 14.1173 13.3254C14.1873 13.1854 14.1523 13.0629 14.0998 12.9578C14.0473 12.8528 13.6275 11.8199 13.4526 11.3998C13.2821 10.9907 13.1091 11.0461 12.9802 11.0396C12.8579 11.0335 12.7178 11.0322 12.5779 11.0322C12.4379 11.0322 12.2105 11.0847 12.0181 11.2948C11.8256 11.5048 11.2833 12.0125 11.2833 13.0453C11.2833 14.0781 12.0356 15.0758 12.1405 15.2158C12.2455 15.3559 13.6208 17.4752 15.7268 18.3842C16.2276 18.6004 16.6187 18.7295 16.9235 18.8262C17.4265 18.9859 17.8841 18.9634 18.2458 18.9093C18.6492 18.8491 19.4879 18.4017 19.6628 17.9117C19.8377 17.4214 19.8377 17.0013 19.7852 16.9138Z" fill="#FBFCFC"/>
</svg>


</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="30" height="30" rx="15" fill="#781BE1"/>
<g clip-path="url(#clip0_307_860)">
<path d="M22.449 13.1544C21.9071 10.8116 20.2576 8.77957 18.0662 7.76754C17.1777 7.35715 16.2493 7.08621 15.2652 7.05035C15.2134 7.05035 15.1576 7.04637 15.1058 7.04637C15.0261 7.04637 14.9464 7.0384 14.8667 7.0384C14.5798 7.02645 14.293 7.02645 14.0061 7.0623C13.2371 7.13004 12.5 7.30535 11.8107 7.5723C11.7828 7.58027 11.7509 7.59223 11.723 7.60418C11.4999 7.67988 11.2927 7.78746 11.0816 7.89106C10.7429 8.06238 10.4082 8.24567 10.1014 8.47278C10.0138 8.53653 10.0337 8.53652 9.93805 8.46879C9.55555 8.18191 9.17305 7.89902 8.77859 7.62809C8.51563 7.44879 8.26062 7.26949 7.97375 7.13004C7.61914 6.95074 7.20477 7.03043 6.9418 7.32129C6.78641 7.4966 6.72266 7.70379 6.72266 7.93488V15.1745C6.72266 15.1745 6.72266 15.1944 6.72664 15.2064C6.73461 15.7602 6.80234 16.3021 6.92984 16.8439C7.61117 19.7127 9.80258 21.9639 12.6514 22.7209C13.2052 22.8683 13.767 22.9639 14.3408 22.9679C14.783 22.9719 15.2293 22.9679 15.6716 22.9121C16.0182 22.8683 16.3609 22.8046 16.6955 22.7169C17.0103 22.6372 17.3131 22.5336 17.612 22.4141C17.6398 22.4021 17.6717 22.3902 17.6996 22.3782C17.7076 22.3743 17.7116 22.3743 17.7195 22.3703C20.6202 21.1789 22.6602 18.3301 22.6602 14.9992V14.788C22.6442 14.2382 22.5725 13.6923 22.449 13.1544ZM19.2575 14.019C18.616 14.6565 17.9785 15.294 17.337 15.9315C16.4445 16.824 15.548 17.7125 14.6555 18.605C14.3368 18.9238 13.9543 19.0792 13.5041 19.0593C13.1056 19.0433 12.751 18.8959 12.4681 18.613C11.6434 17.7882 10.8146 16.9595 9.99781 16.1228C9.23281 15.3379 9.47984 14.0549 10.468 13.6126C11.0537 13.3536 11.739 13.4771 12.1892 13.9274C12.6195 14.3537 13.0498 14.784 13.4762 15.2143C13.4961 15.2343 13.52 15.2542 13.5359 15.2741C13.5598 15.302 13.5838 15.306 13.6077 15.2781C13.6316 15.2542 13.6555 15.2343 13.6794 15.2104C14.807 14.0788 15.9385 12.9472 17.0661 11.8157C17.3649 11.5168 17.7235 11.3575 18.1419 11.3455C19.0264 11.3176 19.7356 12.0149 19.7316 13.0707C19.7277 13.3377 19.5643 13.7122 19.2575 14.019Z" fill="#FBFCFC"/>
</g>
<defs>
<clipPath id="clip0_307_860">
<rect width="15.9375" height="15.9375" fill="white" transform="translate(6.72266 7.03125)"/>
</clipPath>
</defs>
</svg>


</Link>
      <Link className=' transition-all duration-150 ease-in-out hover:scale-95' href={'/'}><svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="30" height="30" rx="15" fill="#781BE1"/>
<g clip-path="url(#clip0_307_857)">
<path d="M10.9038 22.9316C10.346 22.848 9.80814 22.6607 9.32204 22.3817C8.22236 21.764 7.40158 20.6602 7.13861 19.4407C7.03501 18.9665 7.02306 18.3648 7.03501 14.6547C7.04697 10.6656 7.03501 10.8689 7.23423 10.2113C7.32986 9.88456 7.59681 9.32266 7.79204 9.03973C8.50923 7.99564 9.56111 7.32615 10.868 7.08306C11.127 7.03524 11.5055 7.03126 14.9799 7.03126C19.2232 7.03126 19.0838 7.02727 19.777 7.23848C21.1397 7.66886 22.2235 8.69701 22.7056 10.0161C22.9287 10.6377 22.9406 10.7374 22.9566 12.3752L22.9685 13.8577L22.7016 14.037C22.3231 14.288 21.825 14.7423 21.1277 15.4636C20.3269 16.2965 19.5141 17.0696 19.1037 17.3924C18.2152 18.0898 17.4024 18.4883 16.5736 18.6318C16.1433 18.7035 15.4301 18.6756 15.0117 18.568C14.6372 18.4724 14.6611 18.4564 14.5177 18.8749C14.4021 19.2056 14.3304 19.5523 14.3025 19.903L14.2826 20.174L14.183 20.1541C13.3582 19.9947 12.5414 19.3013 12.2267 18.4923C12.1191 18.2333 12.0593 17.9623 12.0513 17.6833L12.0394 17.4562L11.8282 17.2689C11.3899 16.8783 11.107 16.3961 11.0154 15.902C10.872 15.109 11.2465 14.2123 12.0593 13.4073C12.916 12.5545 14.183 11.8851 15.4221 11.626C15.8684 11.5344 16.6573 11.5105 17.0517 11.5782C17.8247 11.7097 18.4542 12.0923 18.8487 12.6661C18.9722 12.8455 18.9802 12.8734 18.9682 13.0328C18.9682 13.1523 18.9204 13.2679 18.8447 13.3595C18.5299 13.7899 17.5896 14.2562 16.5816 14.4753C14.8006 14.8619 13.665 14.3797 13.8443 13.3077C13.8602 13.2001 13.8722 13.1045 13.8642 13.1005C13.8443 13.0806 13.665 13.1682 13.4738 13.2998C13.147 13.5229 12.8602 13.9533 12.7606 14.3677C12.7367 14.4714 12.7247 14.6387 12.7367 14.7981C12.7486 15.0173 12.7725 15.101 12.8681 15.2883C12.9319 15.4118 13.0554 15.5872 13.147 15.6788L13.3104 15.8462L13.2467 15.9259C13.0554 16.173 12.9 16.444 12.7885 16.7349C12.661 17.1254 12.637 17.5399 12.7167 17.9384C12.7885 18.2452 13.0036 18.6636 13.2188 18.9147C13.3821 19.102 13.7606 19.4208 13.8204 19.4208C13.8363 19.4208 13.8483 19.3889 13.8483 19.3491C13.8483 19.1976 13.9718 18.7035 14.0714 18.4684C14.3583 17.767 14.9878 17.1653 15.9839 16.6472C16.1513 16.5595 16.6294 16.3364 17.0517 16.1451C17.9761 15.7267 18.4781 15.4716 18.757 15.2803C19.5539 14.7264 20.048 13.9095 20.2113 12.8734C20.2711 12.4948 20.2711 11.7894 20.2113 11.4068C19.9603 9.78892 18.7212 8.68505 16.9402 8.50573C14.956 8.30249 12.4259 9.80087 10.868 12.1082C10.111 13.232 9.59697 14.4753 9.38181 15.7227C9.29814 16.2049 9.26626 17.1055 9.31806 17.5478C9.44954 18.6796 9.87587 19.5922 10.609 20.3095C10.9756 20.6721 11.4059 20.967 11.88 21.1822C13.4857 21.9314 15.2667 21.9473 16.8326 21.23C17.5099 20.9192 18.1713 20.437 18.8845 19.7356C19.5778 19.0542 20.044 18.4883 21.323 16.7747C22.0282 15.8303 22.59 15.2006 22.8649 15.0452L22.9685 14.9894L22.9566 17.0417C22.9446 19.0303 22.9406 19.106 22.8729 19.4049C22.4665 21.1822 21.1477 22.4853 19.3467 22.8878L19.028 22.9595L15.1074 22.9675C11.892 22.9715 11.1349 22.9675 10.9038 22.9316Z" fill="#FBFCFC"/>
</g>
<defs>
<clipPath id="clip0_307_857">
<rect width="15.9375" height="15.9375" fill="white" transform="translate(7.03125 7.03125)"/>
</clipPath>
</defs>
</svg>


</Link>


    </div>







  </div>







</div>

<div className='lg:w-[687px] w-[361px] h-[279px] flex lg:mb-0 mb-50  p-7  justify-start items-center lg:items-start flex-col gap-3 bg-white rounded-[18px]'>
  <span className='lg:text-[20px] text-[16px] text-[#3E3E3E] font-extrabold '>آدرس فروشگاه</span>
<Image className=' lg:w-[630px] lg:h-[202px] w-[340px] h-[164px]' src={'/assets/template1/8.png'} width={10000} height={10000} alt='map_img'/>


  <div>



  </div>


</div>
      
    






</div>
   
   
   </div>

    </div>
  )
}

export default Index